fio_result/test_xvdo1_64/fio.randread.128K.1.log
/dev/xvdo1: (g=0): rw=randread, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
fio-2.0.13
Starting 1 process

/dev/xvdo1: (groupid=0, jobs=1): err= 0: pid=26614: Sun Jun 29 05:04:10 2014
  read : io=1759.2MB, bw=60003KB/s, iops=468 , runt= 30021msec
    slat (usec): min=13 , max=132989 , avg=2125.98, stdev=12589.96
    clat (msec): min=4 , max=695 , avg=134.38, stdev=82.40
     lat (msec): min=4 , max=698 , avg=136.51, stdev=82.56
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   13], 10.00th=[   20], 20.00th=[   96],
     | 30.00th=[   99], 40.00th=[  102], 50.00th=[  105], 60.00th=[  111],
     | 70.00th=[  188], 80.00th=[  194], 90.00th=[  206], 95.00th=[  297],
     | 99.00th=[  408], 99.50th=[  498], 99.90th=[  603], 99.95th=[  611],
     | 99.99th=[  693]
    bw (KB/s)  : min=49305, max=93767, per=99.69%, avg=59814.34, stdev=5100.36
    lat (msec) : 10=1.34%, 20=8.80%, 50=0.92%, 100=23.57%, 250=58.35%
    lat (msec) : 500=6.59%, 750=0.43%
  cpu          : usr=0.12%, sys=0.94%, ctx=1366, majf=0, minf=2071
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=14073/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1759.2MB, aggrb=60002KB/s, minb=60002KB/s, maxb=60002KB/s, mint=30021msec, maxt=30021msec

Disk stats (read/write):
  xvdo: ios=42028/0, merge=0/0, ticks=4287907/0, in_queue=4295023, util=99.75%