fio_result/test_xvdo1_64/fio.randread.8K.1.log
/dev/xvdo1: (g=0): rw=randread, bs=8K-8K/8K-8K/8K-8K, ioengine=libaio, iodepth=64
fio-2.0.13
Starting 1 process

/dev/xvdo1: (groupid=0, jobs=1): err= 0: pid=26594: Sun Jun 29 05:02:38 2014
  read : io=737536KB, bw=24567KB/s, iops=3070 , runt= 30021msec
    slat (usec): min=6 , max=47 , avg= 8.65, stdev= 0.90
    clat (msec): min=1 , max=51 , avg=20.83, stdev= 5.95
     lat (msec): min=1 , max=51 , avg=20.84, stdev= 5.95
    clat percentiles (usec):
     |  1.00th=[11072],  5.00th=[11712], 10.00th=[12736], 20.00th=[14784],
     | 30.00th=[16768], 40.00th=[18816], 50.00th=[20864], 60.00th=[22912],
     | 70.00th=[24704], 80.00th=[26752], 90.00th=[28800], 95.00th=[30080],
     | 99.00th=[32128], 99.50th=[33024], 99.90th=[35072], 99.95th=[36096],
     | 99.99th=[41728]
    bw (KB/s)  : min=23546, max=29248, per=99.97%, avg=24558.57, stdev=628.09
    lat (msec) : 2=0.10%, 4=0.26%, 10=0.14%, 20=45.83%, 50=53.67%
    lat (msec) : 100=0.01%
  cpu          : usr=1.89%, sys=5.68%, ctx=91814, majf=0, minf=151
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=92192/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=737536KB, aggrb=24567KB/s, minb=24567KB/s, maxb=24567KB/s, mint=30021msec, maxt=30021msec

Disk stats (read/write):
  xvdo: ios=91823/0, merge=34/0, ticks=1912113/0, in_queue=1912854, util=99.74%